In [87]:
import pandas as pd
import numpy as np

In [88]:
# Преобразуем в даты и используем NumPy
forum_users = {
    'User ID': np.array([1,2,3,4,5]),
    'Username': ['bogdan_s','jane_smith','alex123','bob56','mark_wilson'],
    'Age': np.array([18,35,25,38,None]),
    'Joined Date': pd.to_datetime(['2023-01-01','2023-02-01','2023-03-01','2023-04-01','2023-05-01']),
    'Total Posts': np.array([150,230,80,420,310]),
    'Reputation': np.array([500,720,200,940,500])
}
df = pd.DataFrame(forum_users)
df

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s    18  2023-01-01          150         500
1        2   jane_smith    35  2023-02-01          230         720
2        3      alex123    25  2023-03-01           80         200
3        4        bob56    38  2023-04-01          420         940
4        5  mark_wilson  None  2023-05-01          310         500

## Filters

In [89]:
df[['Username','Age']] # Выборка с необходимых колонак

      Username   Age
0     bogdan_s    18
1   jane_smith    35
2      alex123    25
3        bob56    38
4  mark_wilson  None

In [90]:
df.loc[3] # Получить определенную строку Series

User ID                          4
Username                     bob56
Age                             38
Joined Date    2023-04-01 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [91]:
df.loc[2:3] # Получить определенную строки DataFrame, не путать с Series колонка!

   User ID Username Age Joined Date  Total Posts  Reputation
2        3  alex123  25  2023-03-01           80         200
3        4    bob56  38  2023-04-01          420         940

In [92]:
df.loc[2:3,['Username','Age','Reputation']] # Получим строки и необходимые колонки

  Username Age  Reputation
2  alex123  25         200
3    bob56  38         940

In [93]:
df.iloc[3] # Практически тоже самое только не по названиям, а по index

User ID                          4
Username                     bob56
Age                             38
Joined Date    2023-04-01 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [94]:
df.iloc[2:4] # Вернее значение 4 исключаеться, запомнить

   User ID Username Age Joined Date  Total Posts  Reputation
2        3  alex123  25  2023-03-01           80         200
3        4    bob56  38  2023-04-01          420         940

In [95]:
df.iloc[2:4, 1:4]

  Username Age Joined Date
2  alex123  25  2023-03-01
3    bob56  38  2023-04-01

In [96]:
df.iloc[:, 1:4] # Все строки и столбцы 1 до 4 ,4 исключаеться

      Username   Age Joined Date
0     bogdan_s    18  2023-01-01
1   jane_smith    35  2023-02-01
2      alex123    25  2023-03-01
3        bob56    38  2023-04-01
4  mark_wilson  None  2023-05-01

In [97]:
df[df['Age']>=25]

   User ID    Username Age Joined Date  Total Posts  Reputation
1        2  jane_smith  35  2023-02-01          230         720
2        3     alex123  25  2023-03-01           80         200
3        4       bob56  38  2023-04-01          420         940

In [98]:
df['Age'] >= 25

0    False
1     True
2     True
3     True
4    False
Name: Age, dtype: bool

In [99]:
df[df['Total Posts']>=300]

   User ID     Username   Age Joined Date  Total Posts  Reputation
3        4        bob56    38  2023-04-01          420         940
4        5  mark_wilson  None  2023-05-01          310         500

In [100]:
df[df['Reputation']>=300]

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s    18  2023-01-01          150         500
1        2   jane_smith    35  2023-02-01          230         720
3        4        bob56    38  2023-04-01          420         940
4        5  mark_wilson  None  2023-05-01          310         500

In [101]:
df[(df['Total Posts']>=300) &  (df['Age']>=25)]

   User ID Username Age Joined Date  Total Posts  Reputation
3        4    bob56  38  2023-04-01          420         940

In [102]:
(df['Total Posts']>=300) &  (df['Age']>=25)

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [103]:
df['Reputation'].isin([200,500]) # Поиск по колонки

0     True
1    False
2     True
3    False
4     True
Name: Reputation, dtype: bool

In [104]:
df[df['Reputation'].isin([200,500])] # Поиск по колонки

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s    18  2023-01-01          150         500
2        3      alex123    25  2023-03-01           80         200
4        5  mark_wilson  None  2023-05-01          310         500

In [105]:
df[df['Total Posts'].isin(range(200,500))] # Поиск диапозон

   User ID     Username   Age Joined Date  Total Posts  Reputation
1        2   jane_smith    35  2023-02-01          230         720
3        4        bob56    38  2023-04-01          420         940
4        5  mark_wilson  None  2023-05-01          310         500

In [106]:
date_range = pd.date_range(start='2023-02-01',end='2023-04-01')
date_range

DatetimeIndex(['2023-02-01', '2023-02-02', '2023-02-03', '2023-02-04',
               '2023-02-05', '2023-02-06', '2023-02-07', '2023-02-08',
               '2023-02-09', '2023-02-10', '2023-02-11', '2023-02-12',
               '2023-02-13', '2023-02-14', '2023-02-15', '2023-02-16',
               '2023-02-17', '2023-02-18', '2023-02-19', '2023-02-20',
               '2023-02-21', '2023-02-22', '2023-02-23', '2023-02-24',
               '2023-02-25', '2023-02-26', '2023-02-27', '2023-02-28',
               '2023-03-01', '2023-03-02', '2023-03-03', '2023-03-04',
               '2023-03-05', '2023-03-06', '2023-03-07', '2023-03-08',
               '2023-03-09', '2023-03-10', '2023-03-11', '2023-03-12',
               '2023-03-13', '2023-03-14', '2023-03-15', '2023-03-16',
               '2023-03-17', '2023-03-18', '2023-03-19', '2023-03-20',
               '2023-03-21', '2023-03-22', '2023-03-23', '2023-03-24',
               '2023-03-25', '2023-03-26', '2023-03-27', '2023-03-28',
               '2023-03-29', '2023-03-30', '2023-03-31', '2023-04-01'],
              dtype='datetime64[ns]', freq='D')

In [107]:
df[df['Joined Date'].isin(date_range)] # Поиск диапозон дат

   User ID    Username Age Joined Date  Total Posts  Reputation
1        2  jane_smith  35  2023-02-01          230         720
2        3     alex123  25  2023-03-01           80         200
3        4       bob56  38  2023-04-01          420         940

## Sorting

In [108]:
df.sort_values(by='Age')

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1     bogdan_s    18  2023-01-01          150         500
2        3      alex123    25  2023-03-01           80         200
1        2   jane_smith    35  2023-02-01          230         720
3        4        bob56    38  2023-04-01          420         940
4        5  mark_wilson  None  2023-05-01          310         500

In [109]:
df.sort_values(by='Age', ascending=False)

   User ID     Username   Age Joined Date  Total Posts  Reputation
3        4        bob56    38  2023-04-01          420         940
1        2   jane_smith    35  2023-02-01          230         720
2        3      alex123    25  2023-03-01           80         200
0        1     bogdan_s    18  2023-01-01          150         500
4        5  mark_wilson  None  2023-05-01          310         500

In [110]:
df.sort_values(by='Joined Date', ascending=False)

   User ID     Username   Age Joined Date  Total Posts  Reputation
4        5  mark_wilson  None  2023-05-01          310         500
3        4        bob56    38  2023-04-01          420         940
2        3      alex123    25  2023-03-01           80         200
1        2   jane_smith    35  2023-02-01          230         720
0        1     bogdan_s    18  2023-01-01          150         500

In [111]:
# df.sort_values(by='Joined Date',  axis=1)

In [112]:
df[['User ID','Total Posts','Reputation']] # ВЫберим колонки где int/flaot

   User ID  Total Posts  Reputation
0        1          150         500
1        2          230         720
2        3           80         200
3        4          420         940
4        5          310         500

In [113]:
# Sort by values in the row with index 2
df[['User ID','Total Posts','Reputation']].sort_values(by=2,  axis=1, ascending=False)

   Reputation  Total Posts  User ID
0         500          150        1
1         720          230        2
2         200           80        3
3         940          420        4
4         500          310        5